# AquaYOLO (Ultralytics) — numbered layers for clarity
nc: 10
scales: 
  # n: [0.33, 0.25, 1024]
  # s: [0.33, 0.50, 1024]
    # m: [0.67, 0.75, 768]
# l: [1.0, 1.0, 512]
  # x: [1.0, 1.25, 512]


backbone:
  # ----- P1 -----
  - [-1, 1, AquaResidualBlock, [48, 2]]            # L0: P1/2  | s=2 | 320x320x(64·w)

  # ----- P2 -----
  - [-1, 1, AquaResidualBlock, [96, 2]]           # L1: P2/4  | s=2 | 160x160x(128·w)
  - [-1, 2, C2f,              [96, True]]         # L2: C2f (n=3·d) | 160x160x(128·w)

  # ----- P3 -----
  - [-1, 1, AquaResidualBlock, [192, 2]]           # L3: P3/8  | s=2 | 80x80x(256·w)
  - [-1, 4, C2f,              [192, True]]         # L4: C2f (n=6·d) | 80x80x(256·w)

  # ----- P4 -----
  - [-1, 1, AquaResidualBlock, [384, 2]]           # L5: P4/16 | s=2 | 40x40x(512·w)
  - [-1, 4, C2f,              [384, True]]         # L6: C2f (n=6·d) | 40x40x(512·w)

  # ----- P5 -----
  - [-1, 1, AquaResidualBlock, [576, 2]]           # L7: P5/32 | s=2 | 20x20x(512·w) # *r
  - [-1, 2, C2f,              [576, True]]         # L8: C2f (n=3·d) | 20x20x(512·w) # *r

  # ----- Bottleneck -----
  - [-1, 1, SPPF,             [576, 5]]            # L9: SPPF | 20x20x(512·w)  # *r

# taps used by the neck (node indices, not L-numbers):
#   idx 4 → P3 (after C2f[256])  = 80x80x256
#   idx 6 → P4 (after C2f[512])  = 40x40x512
#   idx 9 → P5 (after SPPF)      = 20x20x512

head:
  # ===== Top-down path (DSAM replaces concat+upsample) =====
  - [[6, 9], 1, DSAM, []]                           # L10: DSAM(P4, P5) → 40x40x512
  - [-1,   2, C2f, [384, False]]                 # L11: C2f (shortcut=False, n=3·d) → 40x40x512

  - [[4, -1], 1, DSAM, []]                          # L12: DSAM(P3, up(L11)) → 80x80x256
  - [-1,    2, C2f, [192, False]]                # L13: C2f (shortcut=False, n=3·d) → 80x80x256

  # ===== Bottom-up path (PAN-style; stride-2 convs between DSAMs) =====
  - [-1,    1, Conv, [192, 3, 2]]                   # L14: downsample 80→40 → 40x40x256
  - [[11, -1], 1, DSAM, []]                         # L15: DSAM(L11, L14) → 40x40x512
  - [-1,     2, C2f, [384, False]]               # L16: C2f (shortcut=False, n=3·d) → 40x40x512

  - [-1,     1, Conv, [384, 3, 2]]                  # L17: downsample 40→20 → 20x20x512
  - [[9,  -1], 1, DSAM, []]                         # L18: DSAM(P5, L17) → 20x20x512
  - [-1,     2, C2f, [384, False]]               # L19: C2f (shortcut=False, n=3·d) → 20x20x512

  # ===== Detect (decoupled, anchor-free) =====
  - [[13, 16, 19], 1, Detect, [nc]]                 # L20: Detect on {80x80, 40x40, 20x20}
